# WallTypeWidthMeasuredAt Property (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
ParameterTypeId..::..WallTypeWidthMeasuredAt Property
ParameterTypeId Class See Also
---
"Width Measured At"
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public static ForgeTypeId WallTypeWidthMeasuredAt { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property WallTypeWidthMeasuredAt As ForgeTypeId
	Get
```

Visual C++
---
```text
public:
static property ForgeTypeId^ WallTypeWidthMeasuredAt {
	ForgeTypeId^ get ();
}
```

# See Also
ParameterTypeId Class
Autodesk.Revit.DB Namespace